{
  "basics": {
    "name": "Benjamin Alberto Cifuentes Peña",
    "label": "Desarrollador Full Stack | Ingeniero de Software",
    "image": "./profile.webp",
    "email": "bcifuentesp01@gmail.com",
    "phone": "+569 34000534",
    "url": "linkedin.com/in/bcifuentes01",
    "github": "Benja3o3",
    "summary": "Soy estudiante de Ingeniería Civil Informática en mi último año de universidad desarrollando mi tésis, con sólida experiencia en diversos lenguajes de programación. Me destaco por mis excelentes habilidades comunicativas y mi capacidad para trabajar eficazmente en equipo. Mi interés principal se centra en el desarrollo web/móvil y la creación de plataformas digitales. Siempre estoy buscando nuevas oportunidades para aprender y perfeccionar mis habilidades.",
    "location": {
      "address": "Psje Oncol 545",
      "postalCode": "5150000",
      "city": "San José de la Mariquina",
      "countryCode": "CL",
      "region": "Los Rios"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "Benja3o3",
        "url": "https://github.com/Benja3o3"
      },
      {
        "network": "LinkedIn",
        "username": "Benjamin Cifuentes",
        "url": "https://www.linkedin.com/in/bcifuentes01/"
      }
    ]
  },
  "work": [
    {
      "name": "NTT DATA CENTERS",
      "position": "Centers Junior - Desarrollador Frontend",
      "url": "none",
      "startDate": "2025-06-10",
      "endDate": "Presente",
      "summary": "Desempeño el rol de desarrollador frontend en NTT DATA CENTERS, contribuyendo al desarrollo y mantenimiento de aplicaciones web y plataformas digitales. Mi enfoque principal está en la creación de interfaces de usuario intuitivas y funcionales",
      "highlights": [
        "Participación en la migración y optimización del flujo de contrataciones de la aplicación Movistar utilizando PHP.",
        "Desarrollo e implementación de nuevas funcionalidades orientadas a mejorar la experiencia del usuario y la eficiencia del proceso.",
        "Colaboración estrecha con equipos de diseño y desarrollo para garantizar una integración fluida y una interfaz intuitiva.",
        "Aplicación de buenas prácticas de programación y estándares de calidad para asegurar la escalabilidad y mantenibilidad del código."
      ],
      "tecnologies": ["PHP", "JavaScript", "HTML", "SCSS", "Docker"],
      "type": "Desarrollo Web"
    },
    {
      "name": "Fundacion Educacional Seminario San Fidel",
      "position": "Ayudante de informatica",
      "url": "none",
      "startDate": "2025-03-03",
      "endDate": "2025-07-02",
      "summary": "Desempeñe rol de soporte de informatica en el Liceo Seminario San Fidel, brindando asistencia técnica y apoyo a estudiantes y profesores en el uso de herramientas tecnológicas.",
      "highlights": [
        "Administré correos institucionales y gestioné cuentas de usuario.",
        "Brindé apoyo técnico a docentes y estudiantes en el uso de equipos informáticos.",
        "Proveí soporte a las cuentas de la aplicación Appoderados.",
        "Di soporte y realicé actualizaciones en el sitio web institucional.",
        "Llevé a cabo el seguimiento y la gestión del préstamo de computadores portátiles a estudiantes.",
        "Realicé tareas de mantenimiento de equipos informáticos y resolución de incidencias técnicas."
      ],
      "tecnologies": ["Google Workspace", "Microsoft Office", "WordPress"],
      "type": "Ayudantía"
    },
    {
      "name": "Universidad Austral de Chile",
      "position": "Ingeniero de Software | Desarrollador Full Stack",
      "url": "none",
      "startDate": "2024-08-27",
      "endDate": "Presente",
      "summary": "Proyecto de tesis orientado al desarrollo de una plataforma web para el análisis de datos de prescripciones médicas, enfocada en la detección de patrones de tratamiento, cascadas de prescripciones y apoyo a la toma de decisiones clínicas mediante visualización interactiva.",
      "highlights": [
        "Diseñé e implementé una arquitectura modular utilizando FastAPI, Kafka para procesamiento en tiempo real y PostgreSQL como motor de almacenamiento y consulta eficiente de datos clínicos.",
        "Desarrollé dashboards interactivos en React con visualizaciones avanzadas (D3.js, Chart.js, Leaflet) para representar patrones de prescripción y mapas georreferenciados.",
        "Integré consultas SQL optimizadas y modelos de datos en esquema estrella para facilitar el análisis tanto individual como agregado de tratamientos médicos.",
        "Automaticé la ingesta y transformación de grandes volúmenes de datos desde sistemas APS mediante pipelines personalizados.",
        "Colaboré en el diseño metodológico del observatorio de prescripciones, enfocándome en trazabilidad, alertas de cascadas y generación de indicadores farmacológicos."
      ],
      "tecnologies": [
        "React",
        "D3.js",
        "Chart.js",
        "Leaflet",
        "FastAPI",
        "PostgreSQL",
        "Python",
        "Kafka"
      ],
      "type": "Tesis"
    },
    {
      "name": "Universidad Austral de Chile / Saesa",
      "position": "Ayudante Curso de Base de Datos",
      "url": "none",
      "startDate": "2024-08-27",
      "endDate": "2024-12-08",
      "summary": "Desempeñe el rol de ayudante de un curso de base de datos, brindando apoyo a estudiantes en la comprensión y aplicación de conceptos fundamentales relacionados con bases de datos, SQL y diseño de esquemas.",
      "highlights": [
        "Asistí a los participantes en la instalación y configuración de herramientas como Python, Jupyter, DBeaver y Docker para el trabajo con bases de datos.",
        "Apoyé el modelamiento de bases de datos transaccionales y analíticas, incluyendo la elaboración de esquemas y modelos de datos.",
        "Facilité el aprendizaje y uso del lenguaje SQL para consultas, inserción y manipulación de datos.",
        "Guié la conexión de Python con bases de datos SQL y noSQL para la extracción y análisis de datos.",
        "Introduje el uso de Jupyter Notebook para visualización de datos e informes automatizados."
      ],
      "tecnologies": [
        "PostgreSQL",
        "Docker",
        "Dbdiagram",
        "DBeaver",
        "Python",
        "Jupyter"
      ],
      "type": "Ayudantía"
    },
    {
      "name": "Universidad Austral de Chile",
      "position": "Ayudante de Asignaturas",
      "url": "none",
      "startDate": "2024-03-14",
      "endDate": "2024-12-06",
      "summary": "Desempeñé el rol de ayudante en asignaturas del área de ingeniería de software, brindando apoyo a estudiantes tanto en aspectos técnicos como metodológicos, fomentando el aprendizaje práctico y colaborativo.",
      "highlights": [
        "Taller de Construcción de Software (2 veces): Apoyé el aprendizaje de conceptos fundamentales del desarrollo de software mediante tutorías prácticas con tecnologías como Next.js y React. Guié a los estudiantes en la creación de sus proyectos finales.",
        "Taller de Ingeniería de Software: Asistí a los alumnos en el proceso de desarrollo de software, desde la planificación hasta la implementación, utilizando herramientas como Git y metodologías ágiles.",
        "Ingeniería de Software: Asistí a los alumnos en el uso de herramientas y conceptos clave como diagramas UML, técnicas de refactoring, testing y control de versiones con Git."
      ],
      "tecnologies": ["NextJs", "React", "NodeJs", "Python", "GitHub"],
      "type": "Ayudantía"
    },
    {
      "name": "Data Research",
      "position": "Ingeniero de software | Desarrollador Full Stack",
      "url": "https://www.dataresearch.cl",
      "startDate": "2023-12-18",
      "endDate": "2024-01-15",
      "summary": "Colaboré en el desarrollo de una plataforma web integral para el control y gestión de archivos y carpetas. Esta solución incluyó funcionalidades avanzadas como autenticación, autorización, gestión de roles y permisos, así como un dashboard para analizar la distribución de acciones de los usuarios, como la creación de cuentas y la subida de archivos a lo largo del tiempo.",
      "highlights": [
        "Diseñé y desarrollé partes de la interfaz de usuario aplicando principios de diseño UX/UI.",
        "Implementé componentes interactivos y responsivos para asegurar la accesibilidad en múltiples dispositivos y resoluciones.",
        "Desarrollé una API RESTful robusta para la gestión de los recursos del sistema.",
        "Implementé mecanismos de control de acceso y seguridad para proteger los datos sensibles.",
        "Creé un dashboard interactivo para visualizar y analizar la distribución de acciones de los usuarios."
      ],
      "tecnologies": [
        "React",
        "TypeScript",
        "Python",
        "PostgreSQL",
        "Tailwind",
        "FastAPI",
        "Docker"
      ],
      "type": "Desarrollo Web"
    },
    {
      "name": "Proyecto FONDEF IDeA ID22I10072",
      "position": "Desarrollador Frontend, UX",
      "url": "none",
      "startDate": "2023-01-02",
      "endDate": "2023-01-30",
      "summary": "Práctica inicial para un proyecto FONDEF, que consistía en el desarrollo de una aplicación móvil de ciencia ciudadana centrada en la percepción comunitaria de los incendios. Este proyecto tenía como objetivo involucrar a la comunidad en la recolección y análisis de datos sobre incendios forestales.",
      "highlights": [
        "Desarrollé un sistema de diseño coherente que incluyera componentes reutilizables, colores, tipografía y otros elementos visuales para mantener la consistencia en toda la aplicación.",
        "Realicé ajustes en el diseño para mejorar la usabilidad y la estética de la aplicación, asegurando que fuera fácil de usar y visualmente atractiva.",
        "Realicé pruebas de compatibilidad de la aplicación en diferentes dispositivos móviles para mejorar el alcance con la mayor cantidad de teléfonos posible."
      ],
      "tecnologies": ["Flutter", "Dart", "Figma"],
      "type": "Desarrollo Web"
    }
  ],
  "volunteer": [
    {
      "organization": "TODO",
      "position": "Volunteer",
      "url": "https://organization.com/",
      "startDate": "2012-01-01",
      "endDate": "2013-01-01",
      "summary": "Description…",
      "highlights": ["Awarded 'Volunteer of the Month'"]
    }
  ],
  "education": [
    {
      "institution": "Universad Austral de Chile",
      "url": "https://www.uach.cl",
      "area": "Ingeniería Civil Informática",
      "studyType": "Título Profesional",
      "startDate": "2020-03-18",
      "endDate": "2025",
      "score": "TODO",
      "courses": []
    },
    {
      "institution": "Liceo Seminario San Fidel",
      "url": "https://sanfidel.cl",
      "area": "Licenciatura en Ciencias y Humanidades",
      "studyType": "Enseñanza Media",
      "startDate": "2016-03-03",
      "endDate": "2019-11-08",
      "score": "6.46",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "TODO",
      "date": "2014-11-01",
      "awarder": "Company",
      "summary": "There is no spoon."
    }
  ],
  "certificates": [
    {
      "name": "EF SET English Certificate 51/100 (B2 Upper Intermediate)",
      "date": "2025-01-02",
      "issuer": "EF SET",
      "url": "https://cert.efset.org/ictFe2"
    }
  ],
  "publications": [
    {
      "name": "TODO",
      "publisher": "Company",
      "releaseDate": "2014-10-01",
      "url": "https://publication.com",
      "summary": "Description…"
    }
  ],
  "programingLanguages": [
    {
      "name": "HTML",
      "level": "Intermediate"
    },
    {
      "name": "CSS",
      "level": "Intermediate"
    },
    {
      "name": "JavaScript",
      "level": "Intermediate"
    },
    {
      "name": "TypeScript",
      "level": "Intermediate"
    },
    {
      "name": "React",
      "level": "Intermediate"
    },
    {
      "name": "Astro",
      "level": "Intermediate"
    },
    {
      "name": "Python",
      "level": "Intermediate"
    },
    {
      "name": "NodeJs",
      "level": "Intermediate"
    },
    {
      "name": "PostgreSQL",
      "level": "Intermediate"
    },
    {
      "name": "Flutter",
      "level": "Intermediate"
    },
    {
      "name": "Dart",
      "level": "Intermediate"
    },
    {
      "name": "FastAPI",
      "level": "Intermediate"
    },
    {
      "name": "Docker",
      "level": "Intermediate"
    },
    {
      "name": "RabbitMQ",
      "level": "Intermediate"
    },
    {
      "name": "Kafka",
      "level": "Intermediate"
    },
    {
      "name": "Figma",
      "level": "Intermediate"
    },
    {
      "name": "Git",
      "level": "Intermediate"
    },
    {
      "name": "Tailwind",
      "level": "Intermediate"
    }
  ],
  "skills": [
    {
      "name": "Trabajo en equipo"
    },
    {
      "name": "Comunicación"
    },
    {
      "name": "Resolución de problemas"
    },
    {
      "name": "Pensamiento crítico"
    },
    {
      "name": "Gestión del tiempo"
    },
    {
      "name": "Adaptabilidad"
    },
    {
      "name": "Creatividad"
    }
  ],
  "languages": [
    {
      "language": "Español",
      "fluency": "Nativo"
    },
    {
      "language": "Inglés",
      "fluency": "B2"
    }
  ],
  "interests": [
    {
      "name": "TODO",
      "keywords": ["Ferrets", "Unicorns"]
    }
  ],
  "references": [
    {
      "name": "Jane TODO",
      "reference": "Reference…"
    }
  ],
  "projects": [
    {
      "name": "MicroTracker",
      "startDate": "2024-03",
      "endDate": "2024-07",
      "description": "Aplicación móvil para el seguimiento de microbuses en tiempo real, con funcionalidades de geolocalización y gestión de rutas",
      "highlights": [],
      "tecnologies": ["Flutter", "Python", "PostgreSQL", "Docker"],
      "url": "https://github.com/info288-17-202401/INFO288---MicroTracker",
      "img": "./fruitsell.webp"
    },
    {
      "name": "FruitSell",
      "startDate": "2024-01",
      "endDate": "2024-02",
      "description": "Aplicación móvil para el seguimiento de ventas de frutas para vendedores ambulantes, con trackeo de ubicación y resumen de ventas",
      "highlights": [],
      "tecnologies": ["Flutter", "NodeJs", "PostgreSQL"],
      "url": "https://github.com/Benja3o3/FruitSalesApp",
      "img": "./fruitsell.webp"
    },
    {
      "name": "Verifika-Scraping-Bot",
      "startDate": "2024-08",
      "endDate": "2024-09",
      "description": "Bot de scraping utilizando tecnologias de web scraping y tareas encoladas",
      "highlights": [],
      "tecnologies": ["Python", "React", "PostgreSQL", "RabbitMQ", "Docker"]
    },
    {
      "name": "INBiS",
      "startDate": "2023-07",
      "endDate": "2023-12",
      "description": "Plataforma de análisis de bienestar ciudadano basado en indicadores de calidad de vida y bienestar",
      "highlights": [],
      "tecnologies": ["React", "TypeScript", "NodeJs", "Python", "PostgreSQL"],
      "url": "https://github.com/Benja3o3/INFO282-FrontBack",
      "img": "./inbis.webp"
    }
  ]
}
